{"version":"1.0","truncation":null,"padding":null,"added_tokens":[],"normalizer":{"type":"Sequence","normalizers":[{"type":"Strip","strip_left":true,"strip_right":true},{"type":"NFC"}]},"pre_tokenizer":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true,"use_regex":true},"post_processor":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true,"use_regex":true},"decoder":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true,"use_regex":true},"model":{"type":"BPE","dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"byte_fallback":false,"vocab":{"!":0,"\"":1,"#":2,"$":3,"%":4,"&":5,"'":6,"(":7,")":8,"*":9,"+":10,",":11,"-":12,".":13,"/":14,"0":15,"1":16,"2":17,"3":18,"4":19,"5":20,"6":21,"7":22,"8":23,"9":24,":":25,";":26,"<":27,"=":28,">":29,"?":30,"@":31,"A":32,"B":33,"C":34,"D":35,"E":36,"F":37,"G":38,"H":39,"I":40,"J":41,"K":42,"L":43,"M":44,"N":45,"O":46,"P":47,"Q":48,"R":49,"S":50,"T":51,"U":52,"V":53,"W":54,"X":55,"Y":56,"Z":57,"[":58,"\\":59,"]":60,"^":61,"_":62,"`":63,"a":64,"b":65,"c":66,"d":67,"e":68,"f":69,"g":70,"h":71,"i":72,"j":73,"k":74,"l":75,"m":76,"n":77,"o":78,"p":79,"q":80,"r":81,"s":82,"t":83,"u":84,"v":85,"w":86,"x":87,"y":88,"z":89,"{":90,"|":91,"}":92,"~":93,"¡":94,"¢":95,"£":96,"¤":97,"¥":98,"¦":99,"§":100,"¨":101,"©":102,"ª":103,"«":104,"¬":105,"®":106,"¯":107,"°":108,"±":109,"²":110,"³":111,"´":112,"µ":113,"¶":114,"·":115,"¸":116,"¹":117,"º":118,"»":119,"¼":120,"½":121,"¾":122,"¿":123,"Â":124,"Ã":125,"Ä":126,"Å":127,"Ì":128,"Ð":129,"Ñ":130,"Ø":131,"Ù":132,"à":133,"á":134,"â":135,"ã":136,"ä":137,"å":138,"æ":139,"ç":140,"è":141,"é":142,"ê":143,"ë":144,"ì":145,"í":146,"ï":147,"ð":148,"ĉ":149,"Ġ":150,"Ģ":151,"ģ":152,"Ĥ":153,"ĥ":154,"Ħ":155,"ħ":156,"Ĩ":157,"ĩ":158,"Ī":159,"ī":160,"Ĭ":161,"ĭ":162,"Į":163,"į":164,"İ":165,"ı":166,"Ĳ":167,"ĳ":168,"Ĵ":169,"ĵ":170,"Ķ":171,"ķ":172,"ĸ":173,"Ĺ":174,"ĺ":175,"Ļ":176,"ļ":177,"Ľ":178,"ľ":179,"Ŀ":180,"ŀ":181,"Ł":182,"ł":183,"Ń":184,"><":185,"=\"":186,"te":187,"la":188,"></":189,"Ġc":190,"ss":191,"lass":192,"Ġclass":193,"></><":194,"di":195,"xt":196,"text":197,"er":198,"on":199,"le":200,"en":201,"\"><":202,"in":203,"an":204,"re":205,"div":206,"ti":207,"sp":208,"Ġh":209,"Ġtext":210,"00":211,"ur":212,"></></":213,"ar":214,"Ġm":215,"gr":216,"Ġt":217,"lex":218,"flex":219,"span":220,"or":221,"\"></><":222,"ite":223,"Ġp":224,"ter":225,"ol":226,"url":227,"ou":228,"ver":229,"de":230,"></></><":231,"over":232,"se":233,"der":234,"Ġs":235,"ref":236,"cen":237,"bg":238,"center":239,"Ġw":240,"tion":241,"gra":242,"al":243,"lg":244,"ont":245,"-[":246,"lo":247,"Ġhref":248,"ul":249,"gray":250,"id":251,"lin":252,"Ġb":253,"ac":254,"Ġf":255,"item":256,"xl":257,"us":258,"px":259,"order":260,"\"></></><":261,"ull":262,"Ġflex":263,"Ġr":264,"full":265,"li":266,"op":267,"oun":268,"\"></></":269,"line":270,"ut":271,"ck":272,"ap":273,"items":274,"dar":275,"ran":276,"ded":277,"ounded":278,"col":279,"im":280,"hite":281,"dark":282,"Ġitems":283,"Ġmd":284,"Ġrounded":285,"si":286,"Ġto":287,"ng":288,"ct":289,"Ġlg":290,"Ġhover":291,"white":292,"un":293,"ken":294,"ding":295,"Ġtoken":296,"ow":297,"ation":298,"ve":299,"gh":300,"me":301,"st":302,"rc":303,"gap":304,"ing":305,"lock":306,"it":307,"tive":308,"Ġre":309,"Ġborder":310,"sm":311,"ab":312,"ght":313,"font":314,"ading":315,"Ġgr":316,"late":317,"Ġsrc":318,"10":319,"tif":320,"ent":321,"jus":322,"tify":323,"justify":324,"slate":325,"oc":326,"hover":327,"Ġdark":328,"Ġpy":329,"Ġfont":330,"ge":331,"img":332,"ase":333,"lative":334,"block":335,"old":336,"oup":337,"Ġjustify":338,"ocus":339,"um":340,"idd":341,"bold":342,"idden":343,"border":344,"Ġpx":345,"Ġal":346,"Ġtran":347,"\"></></></><":348,"sition":349,"Ġgap":350,"Ġalt":351,"Ġrelative":352,"ctu":353,"ax":354,"aut":355,"fo":356,"at":357,"12":358,"500":359,"100":360,"one":361,"auto":362,"Ġsm":363,"spac":364,"ue":365,"bla":366,"Ġtransition":367,"50":368,"unctu":369,"unctuation":370,"pr":371,"no":372,"ute":373,"none":374,"Ġin":375,"ight":376,"leading":377,"space":378,"th":379,"Ġgroup":380,"sol":381,"ity":382,"om":383,"ad":384,"Ġmt":385,"Ġfocus":386,"tran":387,"hidden":388,"900":389,"set":390,"dium":391,"low":392,"punctuation":393,"acity":394,"__":395,"opacity":396,"na":397,"md":398,"sc":399,"fore":400,"Ġxl":401,"ton":402,"solute":403,"absolute":404,"utton":405,"medium":406,"400":407,"be":408,"vi":409,"pe":410,"></></></><":411,"out":412,"button":413,"700":414,"base":415,"con":416,"orm":417,"ch":418,"20":419,"Ġbg":420,"ect":421,"Ġmb":422,"ring":423,"get":424,"200":425,"mt":426,"Ġbe":427,"16":428,"tr":429,"co":430,"tle":431,"arget":432,"300":433,"title":434,"sh":435,"Ġtarget":436,"Ġbefore":437,"600":438,"ft":439,"mi":440,"bo":441,"=\"\"":442,"idth":443,"Ġleading":444,"Ġinline":445,"left":446,"flow":447,"ype":448,"ary":449,"bl":450,"=\"_":451,"Ġsh":452,"Ġd":453,"rap":454,"under":455,"underline":456,"tw":457,"adow":458,"\"></></></></><":459,"uration":460,"overflow":461,"ject":462,"ce":463,"=\"-":464,"xs":465,"link":466,"af":467,"semi":468,"semibold":469,"800":470,"Ġlo":471,"he":472,"imary":473,"ag":474,"reen":475,"ble":476,"ain":477,"Ġgrid":478,"primary":479,"ob":480,"black":481,"ink":482,"blue":483,"Ġmx":484,"zy":485,"visi":486,"Ġmax":487,"lazy":488,"nk":489,"visible":490,"after":491,"blank":492,"row":493,"Ġoverflow":494,"Ġtitle":495,"ro":496,"art":497,"max":498,"outline":499,"Ġhe":500,"inter":501,"ack":502,"il":503,"ate":504,"po":505,"nt":506,"Ġtype":507,"-[#":508,"sor":509,"ursor":510,"mb":511,"object":512,"Ġwidth":513,"Ġloading":514,"ontain":515,"24":516,"start":517,"twe":518,"to":519,"age":520,"Ġheight":521,"tom":522,"open":523,"tween":524,"name":525,"between":526,"cols":527,"arent":528,"grid":529,"per":530,"rem":531,"transp":532,"\"></></></></":533,"Ġno":534,"Ġtr":535,"green":536,"transparent":537,"Ġduration":538,"sy":539,"ne":540,"]:":541,"nav":542,"ormal":543,"color":544,"Ġrel":545,"Ġe":546,"Ġshadow":547,"40":548,"normal":549,"Ġz":550,"rink":551,"--":552,"py":553,"ml":554,"ction":555,"contain":556,"pointer":557,"val":558,"of":559,"Ġpb":560,"all":561,"Ġring":562,"tent":563,"Ġspace":564,"value":565,"dient":566,"group":567,"Ġde":568,"gradient":569,"err":570,"Ġobject":571,"\"></></></></></><":572,"form":573,"fi":574,"Ġwhite":575,"Ġwhitespace":576,"Ġpt":577,"Ġx":578,"25":579,"light":580,"]\"><":581,"now":582,"acking":583,"Ġafter":584,"go":585,"nowrap":586,"up":587,"ttom":588,"red":589,"content":590,"el":591,"enu":592,"focus":593,"14":594,"Ġhidden":595,"pt":596,"attr":597,"fa":598,"Ġopacity":599,"nc":600,"Ġtracking":601,"Ġpl":602,"able":603,"ed":604,"ral":605,"80":606,"code":607,"top":608,"rand":609,"Ġtop":610,"ple":611,"ub":612,"br":613,"td":614,"brand":615,"dy":616,"ard":617,"sync":618,"async":619,"coding":620,"Ġdecoding":621,"ze":622,"tight":623,"ale":624,"Ġease":625,"oper":626,"opener":627,"75":628,"wrap":629,"case":630,")]":631,"60":632,"ri":633,"ty":634,"body":635,"inline":636,"sform":637,"Ġblock":638,"ly":639,"Ġtab":640,"cover":641,"Ġsrcset":642,"Ġml":643,"utral":644,"neutral":645,"Ġtag":646,"mx":647,"cursor":648,"image":649,"errer":650,"referrer":651,"Ġmr":652,"translate":653,"32":654,"nx":655,"container":656,"rom":657,"js":658,"od":659,"Ġi":660,":-":661,"\",":662,"active":663,"%]":664,"30":665,"noopener":666,"colors":667,"Ġinset":668,"upper":669,"uppercase":670,"ev":671,"our":672,"min":673,"11":674,"Ġpro":675,"rounded":676,"ak":677,"ader":678,"em":679,"Ġuppercase":680,"shadow":681,"ra":682,"[&":683,"cli":684,"section":685,"ult":686,"pre":687,"tn":688,"urple":689,"qu":690,"ide":691,"css":692,"dex":693,"fault":694,"Ġcursor":695,"Ġtw":696,"bar":697,"Ġme":698,"Ġla":699,"right":700,"ment":701,"Ġpr":702,"menu":703,"index":704,"Ġsc":705,"relative":706,":\"":707,"Ġleft":708,"tag":709,"ari":710,"mp":711,"Ġshrink":712,"class":713,"ke":714,"only":715,"Ġtabindex":716,"Ġcol":717,"></></></></><":718,"Ġa":719,"default":720,"purple":721,"off":722,"bottom":723,"ron":724,"duration":725,"Ġfrom":726,"lay":727,"Ġprose":728,"card":729,"ig":730,"header":731,"ord":732,"mr":733,"cur":734,"inset":735,"ith":736,"tic":737,"Ġdi":738,"sr":739,"15":740,"Ġvalue":741,"Ġse":742,"put":743,"dr":744,"oter":745,"event":746,"shrink":747,"Ġmin":748,"hi":749,"width":750,"ata":751,"Ġnoreferrer":752,"rent":753,"end":754,"48":755,"pb":756,"current":757,"ure":758,"ource":759,"scale":760,"dary":761,"condary":762,"150":763,"abled":764,"sabled":765,"offset":766,"pro":767,"source":768,"side":769,"mon":770,"input":771,"Ġabsolute":772,"footer":773,"Ġbo":774,"secondary":775,"ound":776,"ize":777,"events":778,"ator":779,"18":780,"Ġpo":781,"Ġmy":782,"Ġright":783,"com":784,"pla":785,"her":786,"word":787,"36":788,"spect":789,"sk":790,"cla":791,"transform":792,"dow":793,"Ġ'":794,"clamp":795,"ht":796,"\"></></></></></></><":797,")\"":798,"sub":799,"operty":800,"gre":801,"28":802,"90":803,"lf":804,"ail":805,"ground":806,"ay":807,"mono":808,"=\"\"><":809,"Ġ=":810,"var":811,"]\"":812,"-[-":813,"icon":814,"btn":815,"ĠS":816,"vw":817,"Ġdisabled":818,"Ġof":819,"stron":820,"data":821,"av":822,"we":823,"Ġsize":824,"aria":825,"Ġon":826,"bel":827,"grey":828,"screen":829,"255":830,"chor":831,"hl":832,"></></></></":833,"cture":834,"fit":835,"strong":836,"ĠC":837,"operator":838,"and":839,"type":840,"icture":841,"lar":842,"label":843,"transition":844,"ba":845,"before":846,"Ġnx":847,"70":848,"option":849,"Ġ[&":850,"Ġbottom":851,"key":852,"lement":853,"Ġoutline":854,"ign":855,"am":856,"lect":857,"=\"!":858,"anchor":859,"hljs":860,"click":861,"artic":862,"pl":863,"Ġsizes":864,"Gr":865,"Element":866,"my":867,"Ġitem":868,"\"></></></></></></></><":869,"64":870,"is":871,"aspect":872,"stro":873,"fig":874,"ore":875,"chil":876,"sidebar":877,"ellow":878,"yellow":879,"down":880,"72":881,"list":882,"ext":883,"high":884,"sky":885,"with":886,"rol":887,"Ġtransform":888,"ic":889,"Ġname":890,"Ġline":891,"rg":892,"article":893,"plain":894,"umb":895,"Ġpunctuation":896,"]\"></><":897,"Grid":898,"Ġfor":899,"reate":900,"within":901,"cate":902,"let":903,"=\"[":904,"=\"(":905,"alc":906,"rst":907,"416":908,"Ġunderline":909,"13":910,"Na":911,"box":912,"cor":913,"drop":914,"(--":915,"scri":916,"Ġpointer":917,"create":918,"alse":919,"ot":920,"ff":921,"ustom":922,"ange":923,"et":924,"calc":925,"string":926,"prose":927,"keyword":928,"ĠA":929,"ĠM":930,"indi":931,"('":932,"umn":933,"wide":934,"prop":935,"pink":936,"xed":937,"solid":938,"Ġitemprop":939,"error":940,"last":941,"Ġ<":942,"=\"\"></><":943,"Ġlogo":944,"doc":945,"align":946,"che":947,"Ġnav":948,"back":949,"odal":950,"ĠL":951,"createElement":952,"tyle":953,"ode":954,"dia":955,"Ġpla":956,"},":957,"22":958,"Ġfa":959,"ĠT":960,"inher":961,"inherit":962,"Bo":963,"uted":964,"ex":965,"ph":966,"clip":967,"anim":968,"ĠP":969,"ill":970,"Ġthe":971,"ntax":972,"19":973,"syntax":974,"indigo":975,"Ġmenu":976,"(\"":977,":!":978,"self":979,"atar":980,"))":981,"ile":982,"column":983,"56":984,"night":985,"ew":986,"splay":987,"unction":988,"load":989,"check":990,"divide":991,"picture":992,"></></></></></><":993,"cc":994,"ular":995,"Ġplace":996,"fe":997,"size":998,"spe":999},"merges":["> <","= \"","t e","l a",">< /","Ġ c","s s","la ss","Ġc lass","></ ><","d i","x t","te xt","e r","o n","l e","e n","\" ><","i n","a n","r e","di v","t i","s p","Ġ h","Ġ text","0 0","u r","></ ></","a r","Ġ m","g r","Ġ t","le x","f lex","sp an","o r","\" ></><","i te","Ġ p","te r","o l","ur l","o u","v er","d e","></ ></><","o ver","s e","d er","Ġ s","re f","c en","b g","cen ter","Ġ w","ti on","gr a","a l","l g","on t","- [","l o","Ġh ref","u l","gra y","i d","l in","Ġ b","a c","Ġ f","ite m","x l","u s","p x","or der","\" ></></><","ul l","Ġ flex","Ġ r","f ull","l i","o p","ou n","\" ></></","lin e","u t","c k","a p","item s","d ar","r an","de d","oun ded","c ol","i m","h ite","dar k","Ġ items","Ġm d","Ġr ounded","s i","Ġt o","n g","c t","Ġ lg","Ġh over","w hite","u n","k en","di ng","Ġto ken","o w","a tion","v e","g h","m e","s t","r c","g ap","in g","lo ck","i t","ti ve","Ġ re","Ġb order","s m","a b","gh t","f ont","a ding","Ġ gr","la te","Ġs rc","1 0","ti f","en t","j us","tif y","jus tify","s late","o c","h over","Ġ dark","Ġp y","Ġf ont","g e","im g","a se","la tive","b lock","ol d","ou p","Ġ justify","oc us","u m","id d","b old","idd en","b order","Ġp x","Ġ al","Ġt ran","\"></></ ></><","si tion","Ġ gap","Ġal t","Ġre lative","ct u","a x","a ut","f o","a t","1 2","5 00","1 00","on e","aut o","Ġs m","sp ac","u e","b la","Ġtran sition","5 0","un ctu","unctu ation","p r","n o","u te","n one","Ġ in","i ght","le ading","spac e","t h","Ġgr oup","s ol","it y","o m","a d","Ġm t","Ġf ocus","t ran","h idden","9 00","se t","di um","lo w","p unctuation","ac ity","_ _","op acity","n a","m d","s c","fo re","Ġ xl","t on","sol ute","ab solute","ut ton","me dium","4 00","b e","v i","p e","></></ ></><","ou t","b utton","7 00","b ase","c on","or m","c h","2 0","Ġ bg","e ct","Ġm b","r ing","ge t","2 00","m t","Ġb e","1 6","t r","c o","t le","ar get","3 00","ti tle","s h","Ġt arget","Ġbe fore","6 00","f t","m i","b o","=\" \"","id th","Ġ leading","Ġin line","le ft","f low","y pe","ar y","b l","=\" _","Ġs h","Ġ d","r ap","un der","under line","t w","ad ow","\"></></ ></></><","ur ation","over flow","j ect","c e","=\" -","x s","lin k","a f","se mi","semi bold","8 00","Ġ lo","h e","im ary","a g","re en","b le","a in","Ġgr id","pr imary","o b","bla ck","in k","bl ue","Ġm x","z y","vi si","Ġm ax","la zy","n k","visi ble","af ter","bla nk","r ow","Ġ overflow","Ġ title","r o","ar t","m ax","out line","Ġh e","in ter","ac k","i l","a te","p o","n t","Ġt ype","-[ #","s or","ur sor","m b","ob ject","Ġw idth","Ġlo ading","ont ain","2 4","st art","tw e","t o","a ge","Ġhe ight","t om","op en","twe en","na me","be tween","col s","ar ent","gr id","p er","re m","tran sp","\"></></ ></></","Ġ no","Ġt r","g reen","transp arent","Ġd uration","s y","n e","] :","na v","orm al","col or","Ġre l","Ġ e","Ġsh adow","4 0","n ormal","Ġ z","r ink","- -","p y","m l","c tion","c ontain","po inter","v al","o f","Ġp b","al l","Ġr ing","te nt","Ġ space","val ue","di ent","gr oup","Ġ de","gra dient","er r","Ġ object","\"></></ ></></></><","f orm","f i","Ġw hite","Ġwhite space","Ġp t","Ġ x","2 5","li ght","] \"><","n ow","ack ing","Ġ after","g o","now rap","u p","t tom","re d","con tent","e l","en u","f ocus","1 4","Ġh idden","p t","at tr","f a","Ġ opacity","n c","Ġtr acking","Ġp l","ab le","e d","r al","8 0","co de","t op","ran d","Ġt op","p le","u b","b r","t d","b rand","d y","ar d","sy nc","a sync","co ding","Ġde coding","z e","ti ght","a le","Ġe ase","op er","open er","7 5","w rap","c ase",") ]","6 0","r i","t y","bo dy","in line","s form","Ġb lock","l y","Ġt ab","c over","Ġsrc set","Ġm l","ut ral","ne utral","Ġt ag","m x","c ursor","im age","err er","ref errer","Ġm r","tran slate","3 2","n x","contain er","r om","j s","o d","Ġ i",": -","\" ,","ac tive","% ]","3 0","no opener","color s","Ġin set","up per","upper case","e v","o ur","m in","1 1","Ġp ro","r ounded","a k","a der","e m","Ġ uppercase","sh adow","r a","[ &","c li","se ction","ul t","p re","t n","ur ple","q u","i de","c ss","de x","fa ult","Ġc ursor","Ġt w","b ar","Ġm e","Ġ la","r ight","m ent","Ġp r","m enu","in dex","Ġs c","re lative",": \"","Ġ left","t ag","ar i","m p","Ġsh rink","c lass","k e","on ly","Ġtab index","Ġc ol","></></ ></></><","Ġ a","de fault","p urple","of f","bo ttom","r on","d uration","Ġf rom","la y","Ġpro se","c ard","i g","he ader","or d","m r","c ur","in set","it h","ti c","Ġ di","s r","1 5","Ġ value","Ġ se","p ut","d r","o ter","ev ent","sh rink","Ġm in","h i","w idth","at a","Ġno referrer","r ent","en d","4 8","p b","cur rent","u re","our ce","sc ale","dar y","con dary","1 50","able d","s abled","off set","pr o","s ource","si de","m on","in put","Ġ absolute","fo oter","Ġb o","se condary","oun d","i ze","event s","at or","1 8","Ġp o","Ġm y","Ġr ight","c om","p la","h er","w ord","3 6","sp ect","s k","c la","tran sform","d ow","Ġ '","cla mp","h t","\"></></></></ ></></><",") \"","s ub","oper ty","g re","2 8","9 0","l f","a il","gr ound","a y","mon o","=\" \"><","Ġ =","v ar","] \"","-[ -","i con","b tn","Ġ S","v w","Ġdi sabled","Ġ of","st ron","d ata","a v","w e","Ġs ize","ari a","Ġ on","be l","gre y","sc reen","25 5","ch or","h l","></></ ></></","ctu re","f it","stron g","Ġ C","oper ator","an d","t ype","i cture","la r","la bel","tran sition","b a","be fore","Ġ nx","7 0","op tion","Ġ [&","Ġbo ttom","ke y","le ment","Ġ outline","ig n","a m","le ct","=\" !","an chor","hl js","cli ck","ar tic","p l","Ġsize s","G r","E lement","m y","Ġ item","\"></></></></ ></></></><","6 4","i s","a spect","st ro","fi g","o re","ch il","side bar","el low","y ellow","dow n","7 2","li st","e xt","hi gh","sk y","w ith","r ol","Ġtran sform","i c","Ġ name","Ġ line","r g","artic le","pla in","um b","Ġp unctuation","] \"></><","Gr id","Ġf or","re ate","with in","c ate","le t","=\" [","=\" (","al c","r st","4 16","Ġ underline","1 3","N a","bo x","c or","dr op","( --","sc ri","Ġpo inter","c reate","al se","o t","f f","us tom","an ge","e t","c alc","st ring","pro se","key word","Ġ A","Ġ M","in di","( '","um n","w ide","pr op","p ink","x ed","sol id","Ġitem prop","err or","la st","Ġ <","=\" \"></><","Ġlo go","d oc","al ign","ch e","Ġ nav","b ack","od al","Ġ L","create Element","ty le","o de","di a","Ġp la","} ,","2 2","Ġf a","Ġ T","in her","inher it","B o","ute d","e x","p h","cli p","an im","Ġ P","il l","Ġt he","nt ax","1 9","sy ntax","indi go","Ġm enu","( \"",": !","se lf","at ar",") )","i le","col umn","5 6","n ight","e w","sp lay","un ction","lo ad","che ck","div ide","p icture","></></ ></></></><","c c","u lar","Ġpla ce","f e","si ze","sp e"]}}